src/cf/InformationRegisters/ОжиданиеПодключенияМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОжиданиеПодключенияМК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстНастройкиПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстQRКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОжиданиеПодключенияМК/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресКартинкиQRКодНастроек = СформироватьQRПодключенияМобильнойКассы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНастроекМК(Команда)
	
	ТабДокумент = ПечатьНастроекМКНаСервере();
	ТабДокумент.Показать("Настройки подключения");
	
КонецПроцедуры

&НаСервере
Функция ПечатьНастроекМКНаСервере()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.Защита = Истина;
	
	Макет = Обработки.ПодключенныеКассы.ПолучитьМакет("ПараметрыПодключения");
	
	Область = Макет.ПолучитьОбласть("Настройки");
	
	ПараметрыТабДок = Новый Структура;
	ПараметрыТабДок.Вставить("Заголовок", НСтр("ru = 'Помощник подключения кассы'"));
	ПараметрыТабДок.Вставить("Организация", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Организация: ""%1"", Склад: ""%2""", Запись.Организация, Запись.Склад));
	ПараметрыТабДок.Вставить("ПараметрыПодключения", Запись.ТекстНастройкиПодключения);
	
	Область.Параметры.Заполнить(ПараметрыТабДок);
	ТабДокумент.Вывести(Область);
	
	ТабДокумент.Рисунки.QRКод.Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(АдресКартинкиQRКодНастроек));
	ТабДокумент.Рисунки.QRКод.ЦветФона = Новый Цвет();
	ТабДокумент.Рисунки.QRКод.Линия    = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция СформироватьQRПодключенияМобильнойКассы() Экспорт
	
	ДанныеQR = Запись.ТекстQRКода;
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Вставить("Ширина", 200);
	ПараметрыШтрихкода.Вставить("Высота", 200);
	ПараметрыШтрихкода.Вставить("Штрихкод", СокрЛП(ДанныеQR));
	ПараметрыШтрихкода.Вставить("ТипКода", 16);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	
	Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	ДвоичныеДанные = Картинка.ДвоичныеДанные;
	АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор());
	
	Возврат АдресКартинки;
	
КонецФункции
